Repository: TableProApp/TablePro
Catalog: TableProMobile/TableProMobile/Localizable.xcstrings
Source language: en
Languages: ko, vi, zh_hans, zh_hant

source: New Connections
ko: 새 연결
vi: Kết nối mới
zh_hans: 新建连接
zh_hant: 新增連線

source: New Database
ko: 새 데이터베이스
vi: Cơ sở dữ liệu mới
zh_hans: 新建数据库
zh_hant: 新增資料庫

source: New Group
ko: 새 그룹
vi: Nhóm mới
zh_hans: 新建分组
zh_hant: 新增群組

source: New Tag
ko: 새 태그
vi: Nhãn mới
zh_hans: 新建标签
zh_hant: 新增標籤

source: No Connections
ko: 연결 없음
vi: Chưa có kết nối
zh_hans: 无连接
zh_hant: 沒有連線

source: No Data
ko: 데이터 없음
vi: Không có dữ liệu
zh_hans: 无数据
zh_hant: 沒有資料

source: No Foreign Keys
ko: 외래 키 없음
vi: Không có khóa ngoại
zh_hans: 无外键
zh_hant: 沒有外鍵

source: No Groups
ko: 그룹 없음
vi: Chưa có nhóm
zh_hans: 无分组
zh_hant: 沒有群組

source: No History
ko: 기록 없음
vi: Chưa có lịch sử
zh_hans: 无历史记录
zh_hant: 沒有歷程記錄

source: No Indexes
ko: 인덱스 없음
vi: Không có chỉ mục
zh_hans: 无索引
zh_hant: 沒有索引

source: No Matching Connections
ko: 일치하는 연결 없음
vi: Không có kết nối phù hợp
zh_hans: 无匹配的连接
zh_hant: 沒有符合的連線

source: No Microsoft Entra ID access token was supplied.
ko: Microsoft Entra ID 액세스 토큰이 제공되지 않았습니다.

source: No Referenced Row
ko: 참조된 행 없음
vi: Không có dòng tham chiếu
zh_hans: 无引用行
zh_hant: 無參照列

source: No Results
ko: 결과 없음
vi: Không có kết quả
zh_hans: 无结果
zh_hant: 無結果

source: No Tables
ko: 테이블 없음
vi: Không có bảng
zh_hans: 无表
zh_hant: 無資料表

source: No Tags
ko: 태그 없음
vi: Chưa có nhãn
zh_hans: 无标签
zh_hant: 無標籤

source: No active database session.
ko: 활성 데이터베이스 세션이 없습니다.
vi: Không có phiên cơ sở dữ liệu nào đang hoạt động.
zh_hans: 无活动的数据库会话。
zh_hant: 沒有作用中的資料庫工作階段。

source: No connections match the selected filter.
ko: 선택한 필터와 일치하는 연결이 없습니다.
vi: Không có kết nối nào khớp với bộ lọc đã chọn.
zh_hans: 没有连接匹配所选筛选条件。
zh_hant: 沒有連線符合所選的篩選條件。

source: No data was provided to add.
ko: 추가할 데이터가 제공되지 않았습니다.

source: No primary key values found.
ko: 기본 키 값을 찾을 수 없습니다.
vi: Không tìm thấy giá trị khóa chính.
zh_hans: 未找到主键值。
zh_hant: 找不到主鍵值。

source: No row found in %@ where %@ = '%@'
ko: %@에서 %@ = '%@'인 행을 찾을 수 없음
vi: Không tìm thấy dòng trong %@ với %@ = '%@'
zh_hans: 在%@中未找到%@ = '%@'的行
zh_hant: 在 %@ 中找不到 %@ = '%@' 的列

source: None
ko: 없음
vi: Không
zh_hans: 无
zh_hant: 無

source: Normal
ko: 일반

source: Not Connected
ko: 연결되지 않음
vi: Chưa kết nối
zh_hans: 未连接
zh_hant: 未連線

source: Not connected to SQL Server
ko: SQL Server에 연결되지 않았습니다

source: Not connected to database
ko: 데이터베이스에 연결되지 않았습니다

source: Not set
ko: 설정되지 않음

source: Nullable
ko: NULL 허용
vi: Cho phép NULL
zh_hans: 可为空
zh_hant: 可為空

source: OK
ko: 확인
zh_hans: 好
zh_hant: 好

source: Off
ko: 끔
vi: Tắt
zh_hans: 关闭
zh_hant: 關閉

source: Open Connection
ko: 연결 열기
vi: Mở kết nối
zh_hans: 打开连接
zh_hant: 開啟連線

source: Open Database File
ko: 데이터베이스 파일 열기
vi: Mở tệp cơ sở dữ liệu
zh_hans: 打开数据库文件
zh_hant: 開啟資料庫檔案

source: Open Settings > Privacy & Security > Local Network and turn TablePro on, then try again.
ko: 시스템 설정 > 개인정보 보호 및 보안 > 로컬 네트워크를 열고 TablePro를 켠 다음 다시 시도하십시오.
vi: Mở Cài đặt > Quyền riêng tư & Bảo mật > Mạng nội bộ, bật TablePro, sau đó thử lại.
zh_hans: 请打开 设置 > 隐私与安全性 > 本地网络，开启 TablePro，然后重试。
zh_hant: 請開啟「設定」>「隱私權與安全性」>「區域網路」並開啟 TablePro，然後再試一次。

source: Opens a database connection in TablePro
ko: TablePro에서 데이터베이스 연결을 엽니다
vi: Mở kết nối cơ sở dữ liệu trong TablePro
zh_hans: 在TablePro中打开数据库连接
zh_hant: 在 TablePro 中開啟資料庫連線

source: Opens table data
ko: 테이블 데이터를 엽니다
vi: Mở dữ liệu bảng
zh_hans: 打开表数据
zh_hant: 開啟資料表資料

source: Opens this connection
ko: 이 연결을 엽니다
vi: Mở kết nối này
zh_hans: 打开此连接
zh_hant: 開啟此連線

source: Operator
ko: 연산자
vi: Toán tử
zh_hans: 运算符
zh_hant: 運算子

source: Orange
ko: 주황색

source: Order
ko: 순서
vi: Thứ tự
zh_hans: 排序
zh_hant: 排序

source: Organization
ko: 조직
vi: Tổ chức
zh_hans: 组织
zh_hant: 組織

source: Page number
ko: 페이지 번호
vi: Số trang
zh_hans: 页码
zh_hant: 頁碼

source: Passphrase
ko: 암호 구문
vi: Cụm mật khẩu
zh_hans: 密码短语
zh_hant: 通關密語

source: Passphrase (optional)
ko: 암호 구문(선택 사항)
vi: Mật khẩu khóa (tùy chọn)
zh_hans: 密码短语（可选）
zh_hant: 通關密語（選填）

source: Passphrases don't match.
ko: 암호 구문이 일치하지 않습니다.
vi: Cụm mật khẩu không khớp.
zh_hans: 两次输入的密码短语不一致。
zh_hant: 兩次輸入的通關密語不一致。

source: Password
ko: 암호
vi: Mật khẩu
zh_hans: 密码
zh_hant: 密碼

source: Passwords are excluded by default. To include them, set a passphrase. The file is encrypted with it.
ko: 암호는 기본적으로 제외됩니다. 암호를 포함하려면 암호 구문을 설정하십시오. 파일은 설정한 암호 구문으로 암호화됩니다.
vi: Mặc định mật khẩu không được đưa vào. Để đưa vào, hãy đặt một cụm mật khẩu. Tệp sẽ được mã hóa bằng cụm mật khẩu đó.
zh_hans: 默认不包含密码。若要包含，请设置一个密码短语，文件会用它加密。
zh_hant: 預設不包含密碼。若要包含，請設定一組通關密語，檔案會用它加密。

source: Passwords sync through iCloud Keychain, which is end-to-end encrypted. Only affects new saves. Re-save a password to update its sync.
ko: 암호는 종단 간 암호화된 iCloud 키체인을 통해 동기화됩니다. 새로 저장할 때만 적용됩니다. 암호를 다시 저장하면 해당 암호의 동기화 상태가 업데이트됩니다.

source: Paste
ko: 붙여넣기

source: Paste Key
ko: 키 붙여넣기

source: Paste private key (PEM format)
ko: 개인 키 붙여넣기(PEM 형식)
vi: Dán khóa riêng (định dạng PEM)
zh_hans: 粘贴私钥（PEM格式）
zh_hant: 貼上私密金鑰（PEM 格式）

source: Paste the whole PEM block, including its BEGIN and END lines.
ko: BEGIN 및 END 줄을 포함한 전체 PEM 블록을 붙여넣으십시오.

source: Path
ko: 경로
vi: Đường dẫn
zh_hans: 路径
zh_hant: 路徑

source: Pink
ko: 분홍색

source: Port
ko: 포트
vi: Cổng
zh_hans: 端口
zh_hant: 連接埠

source: Primary Key
ko: 기본 키
vi: Khóa chính
zh_hans: 主键
zh_hant: 主鍵

source: Privacy
ko: 개인정보 보호
vi: Quyền riêng tư
zh_hans: 隐私
zh_hant: 隱私權

source: Private Key
ko: 개인 키
vi: Khóa riêng
zh_hans: 私钥
zh_hant: 私密金鑰

source: Private key
ko: 개인 키

source: Provide a JSON object or an array of objects.
ko: JSON 객체 또는 객체 배열을 제공하십시오.

source: Purple
ko: 보라색

source: Query
ko: 쿼리
vi: Truy vấn
zh_hans: 查询
zh_hant: 查詢

source: Query Error
ko: 쿼리 오류
vi: Lỗi truy vấn
zh_hans: 查询错误
zh_hant: 查詢錯誤

source: Query History
ko: 쿼리 기록
vi: Lịch sử truy vấn
zh_hans: 查询历史
zh_hant: 查詢記錄

source: Query execution failed
ko: 쿼리 실행 실패

source: Query failed: %@
ko: 쿼리 실패: %@

source: Query text and results will be cleared.
ko: 쿼리 텍스트와 결과가 지워집니다.
vi: Nội dung truy vấn và kết quả sẽ bị xóa.
zh_hans: 查询文本和结果将被清除。
zh_hant: 查詢文字與結果將被清除。

source: Query was cancelled
ko: 쿼리가 취소되었습니다

source: Quick Connect
ko: 빠른 연결

source: Quickly connect to your databases.
ko: 데이터베이스에 빠르게 연결합니다.

source: Read-Only
ko: 읽기 전용

source: Reconnecting...
ko: 다시 연결 중...
vi: Đang kết nối lại...
zh_hans: 正在重新连接...
zh_hant: 正在重新連線…

source: Red
ko: 빨간색

source: Redis authentication failed: %1$@ %2$@
ko: Redis 인증 실패: %1$@ %2$@

source: Redis authentication failed: %@
ko: Redis 인증 실패: %@

source: Refresh from iCloud
ko: iCloud에서 새로 고침
vi: Làm mới từ iCloud
zh_hans: 从 iCloud 刷新
zh_hant: 從 iCloud 重新整理

source: Refresh from iCloud?
ko: iCloud에서 새로 고치시겠습니까?
vi: Làm mới từ iCloud?
zh_hans: 从 iCloud 刷新？
zh_hant: 從 iCloud 重新整理？

source: Reload
ko: 다시 로드
vi: Tải lại
zh_hans: 重新加载
zh_hant: 重新載入

source: Remove
ko: 제거

source: Replace
ko: 바꾸기
vi: Thay thế
zh_hans: 替换
zh_hant: 取代

source: Require Face ID
ko: Face ID 요구
vi: Yêu cầu Face ID
zh_hans: 需要 Face ID
zh_hant: 需要 Face ID

source: Require Optic ID
ko: Optic ID 요구
vi: Yêu cầu Optic ID
zh_hans: 需要 Optic ID
zh_hant: 需要 Optic ID

source: Require Touch ID
ko: Touch ID 요구
vi: Yêu cầu Touch ID
zh_hans: 需要 Touch ID
zh_hant: 需要 Touch ID

source: Required
ko: 필수
vi: Bắt buộc
zh_hans: 必填
zh_hant: 必填

source: Results Cleared
ko: 결과가 지워짐
vi: Đã xoá kết quả
zh_hans: 结果已清除
zh_hant: 結果已清除

source: Results cleared due to memory pressure.
ko: 메모리 부족으로 결과가 지워졌습니다.
vi: Kết quả đã bị xoá do thiếu bộ nhớ.
zh_hans: 因内存不足，结果已清除。
zh_hant: 因記憶體不足，結果已清除。

source: Results trimmed due to memory pressure.
ko: 메모리 부족으로 결과 일부가 삭제되었습니다.
vi: Đã cắt bớt kết quả do áp lực bộ nhớ.
zh_hans: 由于内存压力，结果已被裁剪。
zh_hant: 因記憶體不足，結果已縮減。

source: Retry
ko: 재시도
vi: Thử lại
zh_hans: 重试
zh_hant: 重試

source: Role
ko: 역할

source: Row %d of %d
ko: %d/%d행
vi: Dòng %d / %d
zh_hans: 第%d行 / 共%d行
zh_hant: 第 %d 列 / 共 %d 列

source: Row (JSON or CSV)
ko: 행(JSON 또는 CSV)

source: Row updated
ko: 행 업데이트됨
vi: Đã cập nhật dòng
zh_hans: 行已更新
zh_hant: 列已更新

source: Rows (JSON or CSV)
ko: 여러 행(JSON 또는 CSV)

source: Rows per Page
ko: 페이지당 행 수
vi: Số dòng mỗi trang
zh_hans: 每页行数
zh_hant: 每頁列數

source: Run
ko: 실행
vi: Chạy
zh_hans: 运行
zh_hant: 執行

source: Run a Query
ko: 쿼리 실행
vi: Chạy truy vấn
zh_hans: 运行查询
zh_hant: 執行查詢

source: Running query
ko: 쿼리 실행 중
vi: Đang chạy truy vấn
zh_hans: 正在运行查询
zh_hant: 正在執行查詢

source: SID Not Found
ko: SID를 찾을 수 없음

source: SSH Host
ko: SSH 호스트
vi: Máy chủ SSH
zh_hans: SSH主机
zh_hant: SSH 主機

source: SSH Host Key Changed
ko: SSH 호스트 키 변경됨

source: SSH Password
ko: SSH 암호
vi: Mật khẩu SSH
zh_hans: SSH密码
zh_hant: SSH 密碼

source: SSH Port
ko: SSH 포트
vi: Cổng SSH
zh_hans: SSH端口
zh_hant: SSH 連接埠

source: SSH Server
ko: SSH 서버
vi: Máy chủ SSH
zh_hans: SSH服务器
zh_hant: SSH 伺服器

source: SSH Tunnel
ko: SSH 터널
vi: Đường hầm SSH
zh_hans: SSH隧道
zh_hant: SSH 隧道

source: SSH Tunnel Failed
ko: SSH 터널 실패
vi: Đường hầm SSH thất bại
zh_hans: SSH隧道失败
zh_hant: SSH 隧道失敗

source: SSH Username
ko: SSH 사용자 이름
vi: Tên đăng nhập SSH
zh_hans: SSH用户名
zh_hant: SSH 使用者名稱

source: SSH private key not found: %@
ko: SSH 개인 키를 찾을 수 없습니다: %@

source: SSL Mode
ko: SSL 모드
vi: Chế độ SSL
zh_hans: SSL 模式
zh_hant: SSL 模式

source: Safe Mode
ko: 안전 모드
vi: Chế độ an toàn
zh_hans: 安全模式
zh_hant: 安全模式

source: Save
ko: 저장
vi: Lưu
zh_hans: 保存
zh_hant: 儲存

source: Save Changes?
ko: 변경 사항을 저장하시겠습니까?
vi: Lưu thay đổi?
zh_hans: 保存更改？
zh_hant: 儲存變更？

source: Schema
ko: 스키마
zh_hans: 模式
zh_hant: 綱要

source: Schemas
ko: 스키마
zh_hans: 模式
zh_hant: 綱要

source: Search all columns
ko: 모든 열 검색
vi: Tìm kiếm tất cả cột
zh_hans: 搜索所有列
zh_hant: 搜尋所有欄位

source: Search tables
ko: 테이블 검색
vi: Tìm bảng
zh_hans: 搜索表
zh_hant: 搜尋資料表

source: Second value
ko: 두 번째 값
vi: Giá trị thứ hai
zh_hans: 第二个值
zh_hant: 第二個值

source: Section
ko: 섹션
vi: Phần
zh_hans: 分区
zh_hant: 區段

source: Security
ko: 보안
vi: Bảo mật
zh_hans: 安全
zh_hant: 安全性

source: Select Private Key
ko: 개인 키 선택
vi: Chọn khóa riêng
zh_hans: 选择私钥
zh_hant: 選擇私密金鑰

source: Select a Connection
ko: 연결 선택
vi: Chọn kết nối
zh_hans: 选择连接
zh_hant: 選擇連線

source: Server
ko: 서버
vi: Máy chủ
zh_hans: 服务器
zh_hant: 伺服器

source: Service Name
ko: 서비스 이름

source: Service Name Not Found
ko: 서비스 이름을 찾을 수 없음

source: Set up a new database connection
ko: 새 데이터베이스 연결 설정
vi: Thiết lập kết nối cơ sở dữ liệu mới
zh_hans: 设置新的数据库连接
zh_hant: 設定新的資料庫連線

source: Settings
ko: 설정
vi: Cài đặt
zh_hans: 设置
zh_hant: 設定

source: Share
ko: 공유
vi: Chia sẻ
zh_hans: 共享
zh_hant: 分享

source: Share Results
ko: 결과 공유
vi: Chia sẻ kết quả
zh_hans: 共享结果
zh_hant: 分享結果

source: Share Row
ko: 행 공유
vi: Chia sẻ dòng
zh_hans: 共享行
zh_hant: 分享列

source: Share anonymous usage data
ko: 익명 사용 데이터 공유
vi: Chia sẻ dữ liệu sử dụng ẩn danh
zh_hans: 共享匿名使用数据
zh_hant: 分享匿名使用資料

source: Showing the first %d rows. Add LIMIT to fetch more.
ko: 처음 %d개 행을 표시합니다. 더 가져오려면 LIMIT를 추가하십시오.
vi: Đang hiển thị %d dòng đầu tiên. Thêm LIMIT để lấy thêm.
zh_hans: 正在显示前 %d 行。添加 LIMIT 以获取更多。
zh_hant: 正在顯示前 %d 列。加入 LIMIT 以取得更多。

source: Sign In
ko: 로그인

source: Sign in to Microsoft Entra ID with your browser?
ko: 브라우저에서 Microsoft Entra ID에 로그인하시겠습니까?

source: Skip
ko: 건너뛰기
vi: Bỏ qua
zh_hans: 跳过
zh_hant: 略過

source: Some credentials could not be saved to the keychain. You may need to re-enter them later.
ko: 일부 자격 증명을 키체인에 저장할 수 없습니다. 나중에 다시 입력해야 할 수 있습니다.
vi: Không thể lưu một số thông tin xác thực vào keychain. Bạn có thể cần nhập lại sau.
zh_hans: 部分凭证无法保存到钥匙串，稍后可能需要重新输入。
zh_hant: 部分憑證無法儲存至鑰匙圈，稍後可能需要重新輸入。

source: Sort
ko: 정렬
vi: Sắp xếp
zh_hans: 排序
zh_hant: 排序

source: Sort By
ko: 정렬 기준
vi: Sắp xếp theo
zh_hans: 排序方式
zh_hant: 排序依據

source: Stats
ko: 통계
vi: Thống kê
zh_hans: 统计
zh_hant: 統計

source: Status
ko: 상태
vi: Trạng thái
zh_hans: 状态
zh_hant: 狀態

source: Stop
ko: 중지
vi: Dừng
zh_hans: 停止
zh_hant: 停止

source: Stopped at %d rows to stay within memory limits. Add LIMIT to fetch fewer.
ko: 메모리 한도를 넘지 않도록 %d개 행에서 중지했습니다. 더 적게 가져오려면 LIMIT를 추가하십시오.
vi: Đã dừng ở %d dòng để giữ trong giới hạn bộ nhớ. Thêm LIMIT để lấy ít hơn.
zh_hans: 已在 %d 行处停止以保持在内存限制内。添加 LIMIT 以获取更少。
zh_hant: 已在 %d 列處停止以維持在記憶體限制內。加入 LIMIT 以取得更少。

source: Stopped. Showing %d rows.
ko: 중지됨. %d개 행을 표시합니다.
vi: Đã dừng. Đang hiển thị %d dòng.
zh_hans: 已停止。正在显示 %d 行。
zh_hant: 已停止。正在顯示 %d 列。

source: Switching...
ko: 전환 중...
vi: Đang chuyển...
zh_hans: 正在切换...
zh_hant: 正在切換…

source: Sync
ko: 동기화
vi: Đồng bộ
zh_hans: 同步
zh_hant: 同步

source: Sync Now
ko: 지금 동기화
vi: Đồng bộ ngay
zh_hans: 立即同步
zh_hant: 立即同步

source: Sync Passwords
ko: 암호 동기화

source: Sync from iCloud
ko: iCloud에서 동기화
vi: Đồng bộ từ iCloud
zh_hans: 从iCloud同步
zh_hant: 從 iCloud 同步

source: Sync token expired. A full sync will be performed.
ko: 동기화 토큰이 만료되었습니다. 전체 동기화를 수행합니다.

source: Sync with iCloud
ko: iCloud와 동기화
vi: Đồng bộ với iCloud
zh_hans: 与 iCloud 同步
zh_hant: 與 iCloud 同步

source: Sync zone not found. A full sync will be performed.
ko: 동기화 영역을 찾을 수 없습니다. 전체 동기화를 수행합니다.

source: Syncing from iCloud...
ko: iCloud에서 동기화 중...
vi: Đang đồng bộ từ iCloud...
zh_hans: 正在从iCloud同步...
zh_hant: 正在從 iCloud 同步…

source: Syncing…
ko: 동기화 중…
vi: Đang đồng bộ…
zh_hans: 正在同步…
zh_hant: 正在同步…

source: TLS handshake failed: %@
ko: TLS 핸드셰이크 실패: %@

source: Tab
ko: 탭
zh_hans: 标签页
zh_hant: 分頁

source: Table
ko: 테이블
vi: Bảng
zh_hans: 表
zh_hant: 資料表

source: Table Structure
ko: 테이블 구조
vi: Cấu trúc bảng
zh_hans: 表结构
zh_hant: 資料表結構

source: TablePro could not read that file.
ko: TablePro가 해당 파일을 읽을 수 없습니다.

source: TablePro has not connected to %1$@ before. %2$@ key fingerprint: %3$@ Trust this server only if the fingerprint matches the one you expect.
ko: TablePro는 이전에 %1$@에 연결한 적이 없습니다. %2$@ 키 지문: %3$@ 예상한 지문과 일치할 때만 이 서버를 신뢰하십시오.

source: TablePro is Locked
ko: TablePro가 잠겨 있습니다
vi: TablePro đã khóa
zh_hans: TablePro 已锁定
zh_hant: TablePro 已鎖定

source: TablePro will re-download every connection, group, and tag from your iCloud account. Local data on this device is not deleted.
ko: TablePro는 iCloud 계정에서 모든 연결, 그룹 및 태그를 다시 다운로드합니다. 이 기기의 로컬 데이터는 삭제되지 않습니다.
vi: TablePro sẽ tải lại mọi kết nối, nhóm và thẻ từ tài khoản iCloud của bạn. Dữ liệu cục bộ trên thiết bị này không bị xóa.
zh_hans: TablePro 将从你的 iCloud 账户重新下载每个连接、分组和标签。此设备上的本地数据不会被删除。
zh_hant: TablePro 將從你的 iCloud 帳戶重新下載每個連線、群組和標籤。此裝置上的本機資料不會被刪除。

source: Tables
ko: 테이블
vi: Bảng
zh_hans: 表
zh_hant: 資料表

source: Tag
ko: 태그
vi: Nhãn
zh_hans: 标签
zh_hant: 標籤

source: Tags
ko: 태그
vi: Nhãn
zh_hans: 标签
zh_hant: 標籤

source: Test Connection
ko: 연결 테스트
vi: Kiểm tra kết nối
zh_hans: 测试连接
zh_hant: 測試連線

source: Testing...
ko: 테스트 중...
vi: Đang kiểm tra...
zh_hans: 正在测试...
zh_hant: 正在測試…

source: That connection no longer exists in TablePro.
ko: 해당 연결이 더 이상 TablePro에 없습니다.

source: That file holds a certificate, not a private key.
ko: 이 파일에는 개인 키가 아닌 인증서가 들어 있습니다.

source: That file holds a private key, not a certificate.
ko: 이 파일에는 인증서가 아닌 개인 키가 들어 있습니다.

source: That file is not a PEM certificate. Choose a .pem or .crt file, or paste its contents.
ko: 이 파일은 PEM 인증서가 아닙니다. .pem 또는 .crt 파일을 선택하거나 인증서 내용을 붙여넣으십시오.

source: That private key is protected by a passphrase. Remove the passphrase or import a PKCS#12 file instead.
ko: 이 개인 키는 암호로 보호되어 있습니다. 암호를 제거하거나 대신 PKCS#12 파일을 가져오십시오.

source: That text has no certificate or key in it. Paste the whole PEM block, including its BEGIN and END lines.
ko: 이 텍스트에 인증서 또는 키가 없습니다. BEGIN 및 END 줄을 포함한 전체 PEM 블록을 붙여넣으십시오.

source: The CA certificate for this connection is missing. Import it again in the connection's SSL settings.
ko: 이 연결의 CA 인증서가 없습니다. 연결의 SSL 설정에서 다시 가져오십시오.

source: The CSV data has no header row.
ko: CSV 데이터에 헤더 행이 없습니다.

source: The JSON array must contain only objects.
ko: JSON 배열에는 객체만 포함해야 합니다.

source: The Microsoft Entra ID access token was rejected by the driver.
ko: Microsoft Entra ID 액세스 토큰이 드라이버에서 거부되었습니다.

source: The Oracle listener refused the connection (ORA-%ld).
ko: Oracle 리스너가 연결을 거부했습니다(ORA-%ld).

source: The Oracle listener refused the connection.
ko: Oracle 리스너가 연결을 거부했습니다.

source: The Oracle server closed the connection during the login handshake.
ko: Oracle 서버가 로그인 핸드셰이크 중 연결을 종료했습니다.

source: The SSH server may be unreachable or running a different protocol.
ko: SSH 서버에 연결할 수 없거나 서버에서 다른 프로토콜을 사용 중일 수 있습니다.
vi: Máy chủ SSH có thể không truy cập được hoặc đang chạy giao thức khác.
zh_hans: SSH服务器可能无法访问或运行了不同的协议。
zh_hant: SSH 伺服器可能無法連線，或正在執行不同的通訊協定。

source: The SSH tunnel connected but could not forward to the database port.
ko: SSH 터널에 연결했지만 데이터베이스 포트로 전달할 수 없습니다.
vi: Đường hầm SSH đã kết nối nhưng không thể chuyển tiếp đến cổng cơ sở dữ liệu.
zh_hans: SSH隧道已连接但无法转发到数据库端口。
zh_hant: SSH 隧道已連線，但無法轉送至資料庫連接埠。

source: The certificate could not be saved to this device's keychain.
ko: 인증서를 이 기기의 키체인에 저장할 수 없습니다.

source: The certificate file could not be read. Check the password and that the file is a PKCS#12 certificate.
ko: 인증서 파일을 읽을 수 없습니다. 암호가 맞는지, 파일이 PKCS#12 인증서인지 확인하십시오.

source: The client certificate for this connection is missing. Import it again in the connection's SSL settings.
ko: 이 연결의 클라이언트 인증서가 없습니다. 연결의 SSL 설정에서 다시 가져오십시오.

source: The client key for this connection is missing. Import it again in the connection's SSL settings.
ko: 이 연결의 클라이언트 키가 없습니다. 연결의 SSL 설정에서 다시 가져오십시오.

source: The data could not be read: %@
ko: 데이터를 읽을 수 없습니다: %@

source: The data has no values to insert into %@.
ko: %@에 삽입할 값이 입력 데이터에 없습니다.

source: The database limited the result. Showing %d rows.
ko: 데이터베이스에서 결과를 제한했습니다. %d개 행을 표시합니다.
vi: Cơ sở dữ liệu đã giới hạn kết quả. Đang hiển thị %d dòng.
zh_hans: 数据库限制了结果。正在显示 %d 行。
zh_hant: 資料庫限制了結果。正在顯示 %d 列。

source: The encrypted file is corrupt or incomplete
ko: 암호화된 파일이 손상되었거나 불완전합니다

source: The file is not UTF-8 text.
ko: 파일이 UTF-8 텍스트가 아닙니다.

source: The host key for %1$@ has changed. This can mean the server was rebuilt, or that someone is intercepting the connection. Previous fingerprint: %2$@ Current fingerprint: %3$@
ko: %1$@의 호스트 키가 변경되었습니다. 서버가 다시 구축되었거나 누군가 연결을 가로채고 있을 수 있습니다. 이전 지문: %2$@ 현재 지문: %3$@

source: The listener does not know the requested SID
ko: 리스너가 요청한 SID를 인식하지 못합니다

source: The listener does not know the requested service name
ko: 리스너가 요청한 서비스 이름을 인식하지 못합니다

source: The listener does not know this SID. Databases from 12c onward are usually reached by service name instead.
ko: 리스너에서 이 SID를 인식하지 못합니다. 12c 이상 데이터베이스는 일반적으로 서비스 이름으로 연결합니다.

source: The listener does not know this service name. Check it with your DBA, or switch to SID if this is an older database.
ko: 리스너에서 이 서비스 이름을 인식하지 못합니다. DBA에게 확인하거나 이전 버전 데이터베이스인 경우 SID로 전환하십시오.

source: The listener has no handler available for the requested service
ko: 리스너에 요청한 서비스를 처리할 수 있는 핸들러가 없습니다

source: The listener is blocking new connections to the requested service
ko: 리스너가 요청한 서비스에 대한 새 연결을 차단하고 있습니다

source: The operation violates a database constraint.
ko: 작업이 데이터베이스 제약 조건을 위반합니다.
vi: Thao tác vi phạm ràng buộc cơ sở dữ liệu.
zh_hans: 操作违反了数据库约束。
zh_hant: 此操作違反了資料庫限制條件。

source: The query did not finish within the configured timeout, so the connection was reset. Run the query again.
ko: 쿼리가 설정된 제한 시간 내에 완료되지 않아 연결을 재설정했습니다. 쿼리를 다시 실행하십시오.

source: The query returned no rows.
ko: 쿼리에서 반환된 행이 없습니다.
vi: Truy vấn không trả về hàng nào.
zh_hans: 查询未返回任何行。
zh_hant: 查詢未傳回任何列。

source: The server is not responding. Check the host and port.
ko: 서버가 응답하지 않습니다. 호스트와 포트를 확인하십시오.
vi: Máy chủ không phản hồi. Kiểm tra máy chủ và cổng.
zh_hans: 服务器无响应。请检查主机和端口。
zh_hant: 伺服器沒有回應。請檢查主機與連接埠。

source: The server sent an unexpected message and the connection was reset. Run the query again.
ko: 서버에서 예상하지 못한 메시지를 보내 연결을 재설정했습니다. 쿼리를 다시 실행하십시오.

source: The server's host key has changed.
ko: 서버의 호스트 키가 변경되었습니다.

source: The server's host key was not trusted.
ko: 서버의 호스트 키를 신뢰하지 않았습니다.

source: The table "%@" and all its data will be permanently deleted.
ko: "%@" 테이블과 모든 데이터가 영구적으로 삭제됩니다.
vi: Bảng "%@" và toàn bộ dữ liệu của nó sẽ bị xóa vĩnh viễn.
zh_hans: 表"%@"及其所有数据将被永久删除。
zh_hant: 資料表「%@」及其所有資料將被永久刪除。

source: The table or column does not exist.
ko: 테이블 또는 열이 존재하지 않습니다.
vi: Bảng hoặc cột không tồn tại.
zh_hans: 表或列不存在。
zh_hant: 資料表或欄位不存在。

source: The text encoding is invalid.
ko: 텍스트 인코딩이 올바르지 않습니다.

source: This Oracle server is older than release 11.1, which the database driver does not support.
ko: 이 Oracle 서버는 릴리스 11.1보다 이전 버전이며 데이터베이스 드라이버에서 지원하지 않습니다.

source: This account uses a password verifier the database driver does not support.
ko: 이 계정은 데이터베이스 드라이버가 지원하지 않는 암호 검증 형식을 사용합니다.

source: This certificate file needs a password. Certificate files exported without one cannot be read on iOS.
ko: 이 인증서 파일에는 암호가 필요합니다. 암호 없이 내보낸 인증서 파일은 iOS에서 읽을 수 없습니다.

source: This certificate uses a private key type TablePro cannot read.
ko: 이 인증서에는 TablePro에서 읽을 수 없는 유형의 개인 키가 사용되었습니다.

source: This connection has a client certificate but no private key. Import both.
ko: 이 연결에 클라이언트 인증서는 있지만 개인 키가 없습니다. 둘 다 가져오십시오.

source: This connection has a client key but no certificate. Import both.
ko: 이 연결에 클라이언트 키는 있지만 인증서가 없습니다. 둘 다 가져오십시오.

source: This connection is in read-only mode. Write queries are not allowed.
ko: 이 연결은 읽기 전용 모드입니다. 쓰기 쿼리는 허용되지 않습니다.
vi: Kết nối này ở chế độ chỉ đọc. Không cho phép truy vấn ghi.
zh_hans: 此连接为只读模式，不允许写入查询。
zh_hant: 此連線為唯讀模式，不允許寫入查詢。

source: This connection no longer exists. It may have been removed from another device.
ko: 이 연결은 더 이상 존재하지 않습니다. 다른 기기에서 제거되었을 수 있습니다.
vi: Kết nối này không còn tồn tại. Có thể đã bị xóa từ thiết bị khác.
zh_hans: 此连接已不存在。它可能已在其他设备上被移除。
zh_hant: 此連線已不存在，可能已從其他裝置移除。

source: This connection's CA certificate is not readable on this device (%@). Certificate files do not sync between devices, so add the certificate here or lower the SSL mode to Required.
ko: 이 기기에서 이 연결의 CA 인증서를 읽을 수 없습니다(%@). 인증서 파일은 기기 간에 동기화되지 않으므로 이 기기에 인증서를 추가하거나 SSL 모드를 필수(Required)로 낮추십시오.

source: This connection's client certificate is not readable on this device (%@). Certificate files do not sync between devices, so add the certificate here before connecting.
ko: 이 기기에서 이 연결의 클라이언트 인증서를 읽을 수 없습니다(%@). 인증서 파일은 기기 간에 동기화되지 않으므로 연결하기 전에 이 기기에 인증서를 추가하십시오.

source: This connection's client key is not readable on this device (%@). Key files do not sync between devices, so add the key here before connecting.
ko: 이 기기에서 이 연결의 클라이언트 키를 읽을 수 없습니다(%@). 키 파일은 기기 간에 동기화되지 않으므로 연결하기 전에 이 기기에 키를 추가하십시오.

source: This database has no tables.
ko: 이 데이터베이스에는 테이블이 없습니다.
vi: Cơ sở dữ liệu này không có bảng.
zh_hans: 此数据库没有表。
zh_hant: 此資料庫沒有資料表。

source: This file has no private key. Export the certificate together with its key.
ko: 이 파일에 개인 키가 없습니다. 인증서를 개인 키와 함께 내보내십시오.

source: This file is encrypted
ko: 이 파일은 암호화되어 있습니다
vi: Tệp này được mã hóa
zh_hans: 此文件已加密
zh_hant: 此檔案已加密

source: This file is encrypted and requires a passphrase
ko: 이 파일은 암호화되어 있어 암호가 필요합니다

source: This file is not a valid TablePro export
ko: 이 파일은 올바른 TablePro 내보내기 파일이 아닙니다

source: This file requires a newer version of TablePro (format version %d)
ko: 이 파일을 사용하려면 더 최신 버전의 TablePro가 필요합니다(파일 형식 버전 %d)

source: This query will modify data. Are you sure you want to continue?
ko: 이 쿼리는 데이터를 변경합니다. 계속하시겠습니까?
vi: Truy vấn này sẽ thay đổi dữ liệu. Bạn có chắc muốn tiếp tục?
zh_hans: 此查询将修改数据，确定要继续吗？
zh_hant: 此查詢將會修改資料。確定要繼續嗎？

source: This server has no password set for the default user. Clear the Password field.
ko: 이 서버의 기본 사용자에게는 암호가 설정되어 있지 않습니다. 암호 필드를 비우십시오.

source: This server predates Redis 6 and takes no username. Clear the Username field.
ko: 이 서버는 Redis 6 이전 버전이므로 사용자 이름을 사용하지 않습니다. 사용자 이름 필드를 비우십시오.

source: This table has no foreign key relationships.
ko: 이 테이블에는 외래 키 관계가 없습니다.
vi: Bảng này không có quan hệ khóa ngoại.
zh_hans: 此表没有外键关系。
zh_hant: 此資料表沒有外鍵關聯。

source: This table has no indexes.
ko: 이 테이블에는 인덱스가 없습니다.
vi: Bảng này không có chỉ mục.
zh_hans: 此表没有索引。
zh_hant: 此資料表沒有索引。

source: This table is empty.
ko: 이 테이블은 비어 있습니다.
vi: Bảng này trống.
zh_hans: 此表为空。
zh_hant: 此資料表是空的。
